tap "anchore/grype"
tap "codeclimate/formulae"
tap "ddosify/tap"
tap "gesquive/tap"
tap "github/gh"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "reviewdog/tap"
tap "shivammathur/extensions"
tap "shivammathur/php"
tap "wpscanteam/tap"
brew "act"
brew "python@3.10"
brew "ansible"
brew "aspell"
brew "autoconf"
brew "bandwhich"
brew "brew-php-switcher"
brew "glib"
brew "pkg-config"
brew "coreutils"
brew "openldap"
brew "zstd"
brew "dive"
brew "dog"
brew "eg-examples"
brew "faas-cli"
brew "freetds"
brew "fswatch"
brew "gh"
brew "git"
brew "git-extras"
brew "git-flow-avh"
brew "git-recent"
brew "gnu-sed"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "goaccess"
brew "netpbm"
brew "icu4c"
brew "harfbuzz"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "gzip"
brew "hadolint"
brew "htop"
brew "httrack"
brew "imagemagick"
brew "jq"
brew "lastpass-cli"
brew "lazydocker"
brew "libpq"
brew "libvoikko"
brew "m-cli"
brew "midnight-commander"
brew "nmap"
brew "nvm"
brew "openjdk"
brew "openapi-generator"
brew "openfortivpn"
brew "phpstan"
brew "python@3.8"
brew "qcachegrind"
brew "qt"
brew "rcm"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "skopeo"
brew "terminal-notifier", link: false
brew "terraform@0.12"
brew "testssl"
brew "tfenv"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "viddy"
brew "watch"
brew "wget"
brew "z"
brew "anchore/grype/grype"
brew "ddosify/tap/ddosify"
brew "gesquive/tap/git-user"
brew "reviewdog/tap/reviewdog"
brew "shivammathur/extensions/xdebug@7.4"
brew "shivammathur/extensions/xdebug@8.0"
brew "shivammathur/extensions/xdebug@8.1"
brew "shivammathur/php/php"
brew "shivammathur/php/php@7.4"
brew "shivammathur/php/php@8.0"
brew "wpscanteam/tap/wpscan"
cask "fig"
cask "fog"
cask "fontplop"
cask "fork"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "keybase"
cask "lens"
cask "ngrok"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicklookase"
cask "sequel-ace"
cask "suspicious-package"
cask "syntax-highlight"
cask "vlc"
cask "warp"
