jorgebucaran/fisher
ilancosman/tide@v6
jethrokuan/z
halostatue/fish-macos@v7
jgusta/paths
danhper/fish-ssh-agent
halostatue/fish-brew@v3
edc/bass
jorgebucaran/nvm.fish
fabioantunes/fish-nvm
